saveproject/app/Http/Controllers/Backend/SubCategoryController.php

select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 5, 6, 7, 9, 13)
---
    public function index()
    {
        $subCategories = SubCategory::with(['category'])->latest()->get();

select * from `categories` order by `created_at` desc
---
    public function create()
    {
        $categories = Category::latest()->get();

insert into `sub_categories` (`category_id`, `subcategory_name_en`, `subcategory_name_bn`, `subcategory_slug_en`, `subcategory_slug_bn`, `updated_at`, `created_at`) values ('1', 'Bois Assan', '', 'bois-assan', '', '2022-08-08 11:08:40', '2022-08-08 11:08:40')
---
    public function store(SubCategoryStoreRequest $request)
    {
        SubCategory::create([
            'category_id' => $request->input('category_id'),
            'subcategory_name_en' => $request->input('subcategory_name_en'),
            'subcategory_name_bn' => $request->input('subcategory_name_bn'),
            'subcategory_slug_en' => Str::slug($request->input('subcategory_name_en')),
            'subcategory_slug_bn' => Str::slug($request->input('subcategory_name_bn')),
        ]);

select * from `categories` order by `created_at` desc
---
    public function edit(SubCategory $subcategory)
    {
        $categories = Category::latest()->get();

select * from `sub_categories` where `sub_categories`.`id` = '33' limit 1
---
    public function update(SubCategoryStoreRequest $request, $id)
    {

        //dd($request->all(), $id);
        $subCategory = SubCategory::findOrFail($id);