saveproject/app/Http/Controllers/Frontend/CartPageController.php

    public function myCartView()

    {

        $categories = Category::with(['subcategory', 'subsubcategory', 'products'])->orderBy('category_name_en', 'ASC')->get();
---
select * from `products` where `products`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sub_categories` where `sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sub_sub_categories` where `sub_sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)