saveproject/app/Http/Controllers/Frontend/FrontendPageController.php

select * from `products` where `products`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sub_categories` where `sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sub_sub_categories` where `sub_sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sliders` where `slider_name` = 'Main-Slider' and `slider_status` = 1 limit 3
select * from `images` where `images`.`product_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21)
select * from `products` where `new_arrival` = 1 and `status` = 1 limit 20
select * from `categories` limit 1 offset 0
select * from `products` where `category_id` = 1 and `status` = 1 order by `created_at` desc limit 20
select * from `brands` limit 1 offset 0
select * from `products` where `brand_id` = 1 and `status` = 1 order by `created_at` desc limit 20
---
    public function home()
    {
        $categories = Category::with(['subcategory', 'subsubcategory', 'products'])->orderBy('category_name_en', 'ASC')->get();
        $sliders = Slider::where('slider_name', '=', 'Main-Slider')->where('slider_status', '=', 1)->limit(3)->get();
        $new_products = Product::with(['images'])
        ->where('new_arrival' ,'=', 1)
        ->where('status', 1)->limit(20)->get();

        $skip_category_0 = Category::skip(0)->first();
        $skip_category_products_0 = Product::where('category_id', $skip_category_0->id)
                        ->where('status', 1)
                        ->latest()->limit(20)->get();

        $skip_brand_0 = Brand::skip(0)->first();
        $skip_brand_products_0 = Product::where('brand_id', $skip_brand_0->id)
                        ->where('status', 1)
                        ->latest()->limit(20)->get();

select * from `sub_categories` where `sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `images` where `images`.`product_id` in (28)
select * from `products` where `products`.`id` = '28' limit 1
select * from `products` where `category_id` = '5' and `id` != '18' order by `id` desc, `created_at` desc limit 6
---
    public function productDeatil($id, $slug)
    {
        $categories = Category::with(['subcategory'])->orderBy('category_name_en', 'ASC')->get();
        $product = Product::with(['images'])->findOrFail($id);
        $colors_en = explode(',', $product->product_color_en);
        $colors_bn = explode(',', $product->product_color_bn);
        $size_en = explode(',', $product->product_size_en);
        $size_bn = explode(',', $product->product_size_bn);
        $longueur = explode(',', $product->longueur);
        $largeur = explode(',', $product->largeur);
        $epaisseur = explode(',', $product->epaisseur);
        $related_products = Product::where('category_id',$product->category_id)
        ->where('id', '!=', $id)->orderBy('id','DESC')->latest()->limit(6)->get();

select * from `products` where `products`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sub_categories` where `sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `sub_sub_categories` where `sub_sub_categories`.`category_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select count(*) as aggregate from `products` where `status` = 1 and `subcategory_id` = '17'
---
    public function subcategoryProducts($id, $slug)
    {
        $categories = Category::with(['subcategory', 'subsubcategory', 'products'])->orderBy('category_name_en', 'ASC')->get();
        $subcategory_products = Product::where('status', 1)->where('subcategory_id', $id)->orderBy('id','DESC')->paginate(50);